<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2019/9/18
 * Time: 16:33
 */

namespace app\api\controller;
use app\index\model\Realsql as RealsqlModel;
use app\index\model\Phone as PhoneModel;
use think\Controller;
use think\Db;
use think\Request;
use think\Validate;

class Real extends Common
{
    protected function initialize()
    {
        parent::initialize();
    }
    public function real_time()
    {
        $zone = $this->request->param('zone');

        //$last_time = Db::connect('yk_config')->table('history')->field('TIME')->order('TIME','desc')->limit(1)->find();
        /*$real =Db::connect('yk_config')
            ->table('history')
            ->where('TIME','=',function($query){
                $query->table('history')->field('TIME')->order('TIME','desc')->limit(1);
            })
            ->select();*/
        /*$realdata = [];
        $real = Db::connect('yk_config')->table('newtable')
            ->where('TIME','=',function($query){
                $query->table('newtable')->field('TIME')->order('TIME','desc')->limit(1);
            })
            ->field('NAME,VALUE')
            ->where('ZONE',$zone)
            ->select();
        foreach ($real as $value){
            $realdata[$value['NAME']] = $value['VALUE'];
        }*/
        $conn=odbc_connect('KingHistorian','sa','sa');
        if (!$conn)
        {
            exit("连接失败: " . $conn);
        }

        $sql="SELECT * FROM realtime where TagName like 'QS_%".$zone."%'";
        $rs=odbc_exec($conn,$sql);

        if (!$rs)
        {
            exit("SQL 语句错误");
        }
        $yk_arr = array();
        while (odbc_fetch_row($rs))
        {
//            $name = substr(odbc_result($rs,"TagName"),-5);
            /* $compname=odbc_result($rs,"TagName");*/
            //$conname=odbc_result($rs,"DataTime");
//            if($name == $zone){
                $yk_arr[substr(odbc_result($rs,"TagName"),3)] =odbc_result($rs,"DataValue");
//            }
//            $yk_arr[$name]['TagName'] = $name;
//            $yk_arr[$name]['DataTime'] = odbc_result($rs,"DataTime");
//            $yk_arr[$name]['DataValue'] = odbc_result($rs,"DataValue");
//            echo "<tr><td>$compname</td>";
            //echo "<td>$conname</td></tr>";
//            $yk_arr[substr(odbc_result($rs,"TagName"),16)] = odbc_result($rs,"DataTime");
//            $yk_arr[odbc_result($rs,"DataTime")] =odbc_result($rs,"DataValue");

        }
        odbc_close($conn);
        /*dump($yk_arr);
        die;*/
        //dump($realdata);
        /*$return_data['code'] = 200;
        $return_data['msg']  = '查询成功！';
        $return_data['data'] = $real;*/
        echo json_encode($yk_arr,JSON_UNESCAPED_UNICODE);die;
    }
    public function real_times()
    {
        $zone = $this->request->param('zone');
        $name = $this->request->param('name');
        //$last_time = Db::connect('yk_config')->table('newtable')->field('TIME')->order('TIME','desc')->limit(1)->find();
        /*$real =Db::connect('yk_config')
            ->table('history')
            ->where('TIME','=',function($query){
                $query->table('history')->field('TIME')->order('TIME','desc')->limit(1);
            })
            ->select();*/
//        $realdata = [];
        /*$real = Db::connect('yk_config')->table('newtable')
            ->where('TIME','in',function($query){
                $query->table('newtable')->field('TIME')->order('TIME','desc')->limit(1000);
            })
            ->field('TIME,VALUE')
            ->where('ZONE',$zone)
           // ->where('NAME',$name)
            ->select();*/
//        $real_times = Db::connect('yk_config')
//            ->table('newtable')
//            ->field('TIME,VALUE')
//            ->order('TIME','esc')
//            ->where('NAME',$name)
//            ->limit(100)
//            ->select();
        //dump($last_time);
        /*$return_data['code'] = 200;
        $return_data['msg']  = '查询成功！';
        $return_data['data'] = $real;*/
//        foreach ($real_times as $value){
//            $realdata[$value['TIME']] = $value['VALUE'];
//        }
//        echo json_encode($realdata,JSON_UNESCAPED_UNICODE);die;

        $pars = 'QS_'.$name.'_'.$zone;  //区分 T LT
        $conn=odbc_connect('KingHistorian','sa','sa');
        if (!$conn)
        {
            exit("连接失败: " . $conn);
        }
        $sql="SELECT top 200 * FROM history where TagName like '%".$pars."' and DataTime > '2019-10-10' order by DataTime desc";
        $rs=odbc_exec($conn,$sql);

        if (!$rs)
        {
            exit("SQL 语句错误");
        }

        $yk_arr = array();
        $num = 0;
        while (odbc_fetch_array($rs))
        {
//            $yk_arr[substr(odbc_result($rs,"TagName"),16)] =odbc_result($rs,"DataValue");
//            $yk_arr[] =  array(odbc_result($rs,"DataTime") => odbc_result($rs,"DataValue"));
            $yk_arr[odbc_result($rs,"DataTime")] = odbc_result($rs,"DataValue");
//            $name = substr(odbc_result($rs,"TagName"),-5);
            /* $compname=odbc_result($rs,"TagName");*/
            //$conname=odbc_result($rs,"DataTime");
//            if($name == $zone){
//            }
//            $yk_arr[$name]['TagName'] = $name;
//            $yk_arr[$name]['DataTime'] = odbc_result($rs,"DataTime");
//            $yk_arr[$name]['DataValue'] = odbc_result($rs,"DataValue");
//            echo "<tr><td>$compname</td>";
            //echo "<td>$conname</td></tr>";
//            $yk_arr[substr(odbc_result($rs,"TagName"),16)] = odbc_result($rs,"DataTime");
//            $yk_arr[odbc_result($rs,"DataTime")] =odbc_result($rs,"DataValue");
        }
        odbc_close($conn);
        /*dump($yk_arr);
        die;*/
        //dump($realdata);
        /*$return_data['code'] = 200;
        $return_data['msg']  = '查询成功！';
        $return_data['data'] = $real;*/
        echo json_encode(array_reverse($yk_arr) ,JSON_UNESCAPED_UNICODE);die;

    }

    public function real_timest()
    {
        $zone = $this->request->param('zone');
        $name = $this->request->param('name');
        //$last_time = Db::connect('yk_config')->table('newtable')->field('TIME')->order('TIME','desc')->limit(1)->find();
        /*$real =Db::connect('yk_config')
            ->table('history')
            ->where('TIME','=',function($query){
                $query->table('history')->field('TIME')->order('TIME','desc')->limit(1);
            })
            ->select();*/
//        $realdata = [];
        /*$real = Db::connect('yk_config')->table('newtable')
            ->where('TIME','in',function($query){
                $query->table('newtable')->field('TIME')->order('TIME','desc')->limit(1000);
            })
            ->field('TIME,VALUE')
            ->where('ZONE',$zone)
           // ->where('NAME',$name)
            ->select();*/
//        $real_times = Db::connect('yk_config')
//            ->table('newtable')
//            ->field('TIME,VALUE')
//            ->order('TIME','esc')
//            ->where('NAME',$name)
//            ->limit(100)
//            ->select();
        //dump($last_time);
        /*$return_data['code'] = 200;
        $return_data['msg']  = '查询成功！';
        $return_data['data'] = $real;*/
//        foreach ($real_times as $value){
//            $realdata[$value['TIME']] = $value['VALUE'];
//        }
//        echo json_encode($realdata,JSON_UNESCAPED_UNICODE);die;

        $pars = 'QS_'.$name.'_'.$zone;  //区分 T LT
        $conn=odbc_connect('KingHistorian','sa','sa');
        if (!$conn)
        {
            exit("连接失败: " . $conn);
        }
        $sql="SELECT top 200 * FROM history where TagName like '%".$pars."' and DataTime > '2019-10-10' order by DataTime desc";
        $rs=odbc_exec($conn,$sql);

        if (!$rs)
        {
            exit("SQL 语句错误");
        }

        $yk_arr = array();
        $num = 0;
        while (odbc_fetch_array($rs))
        {
//            $yk_arr[substr(odbc_result($rs,"TagName"),16)] =odbc_result($rs,"DataValue");
//            $yk_arr[] =  array(odbc_result($rs,"DataTime") => odbc_result($rs,"DataValue"));
            $yk_arr[] = ['time'=>odbc_result($rs,"DataTime"),'data'=>odbc_result($rs,"DataValue")];
//            $yk_arr[odbc_result($rs,"DataTime")] = odbc_result($rs,"DataValue");
//            $name = substr(odbc_result($rs,"TagName"),-5);
            /* $compname=odbc_result($rs,"TagName");*/
            //$conname=odbc_result($rs,"DataTime");
//            if($name == $zone){
//            }
//            $yk_arr[$name]['TagName'] = $name;
//            $yk_arr[$name]['DataTime'] = odbc_result($rs,"DataTime");
//            $yk_arr[$name]['DataValue'] = odbc_result($rs,"DataValue");
//            echo "<tr><td>$compname</td>";
            //echo "<td>$conname</td></tr>";
//            $yk_arr[substr(odbc_result($rs,"TagName"),16)] = odbc_result($rs,"DataTime");
//            $yk_arr[odbc_result($rs,"DataTime")] =odbc_result($rs,"DataValue");
        }
        odbc_close($conn);
        /*dump($yk_arr);
        die;*/
        //dump($realdata);
        /*$return_data['code'] = 200;
        $return_data['msg']  = '查询成功！';
        $return_data['data'] = $real;*/
        echo json_encode(array_reverse($yk_arr) ,JSON_UNESCAPED_UNICODE);die;

    }

    public function get_last_real()
    {
        $zone = $this->request->param('zone');
        $name = $this->request->param('name');
        $pars = 'QS_'.$name.'_'.$zone; //区分 T LT
        $conn=odbc_connect('KingHistorian','sa','sa');
        if (!$conn)
        {
            exit("连接失败: " . $conn);
        }
        $sql="SELECT * FROM realtime where TagName like '%".$pars."'";
        $rs=odbc_exec($conn,$sql);

        if (!$rs)
        {
            exit("SQL 语句错误");
        }
        $yk_arr = array();
        while (odbc_fetch_row($rs))
        {
            $yk_arr[odbc_result($rs,"DataTime")] =odbc_result($rs,"DataValue");
        }
        odbc_close($conn);
        /*dump($yk_arr);
        die;*/
        //dump($realdata);
        /*$return_data['code'] = 200;
        $return_data['msg']  = '查询成功！';
        $return_data['data'] = $real;*/
        echo json_encode($yk_arr,JSON_UNESCAPED_UNICODE);die;

//        $real_times = Db::connect('yk_config')
//            ->table('newtable')
//            ->field('TIME,VALUE')
//            ->order('TIME','desc')
//            ->where('NAME',$name)
//            ->find();
//        $realdata = [];
//        $realdata[$real_times['TIME']] = $real_times['VALUE'];
//        echo json_encode($realdata,JSON_UNESCAPED_UNICODE);die;
    }

    public function status_refresh()
    {
        return  'false';
    }

    public function call_ericsson()
    {

//        $msg = 'hello';
//        $handle = stream_socket_client("udp://127.0.0.1:22335", $errno, $errstr);
//        if( !$handle ){
//            die("ERROR: {$errno} - {$errstr}\n");
//        }
//        fwrite($handle, $msg."\n");
//        $result = fread($handle, 1024);
//        fclose($handle);

        //创建一个socket套接流
        $socket = socket_create(AF_INET,SOCK_DGRAM,SOL_UDP);
        /****************设置socket连接选项，这两个步骤你可以省略*************/
        //接收套接流的最大超时时间1秒，后面是微秒单位超时时间，设置为零，表示不管它
        socket_set_option($socket, SOL_SOCKET, SO_RCVTIMEO, array("sec" => 1, "usec" => 0));
        //发送套接流的最大超时时间为6秒
        socket_set_option($socket, SOL_SOCKET, SO_SNDTIMEO, array("sec" => 1, "usec" => 0));
        /****************设置socket连接选项，这两个步骤你可以省略*************/

        //连接服务端的套接流，这一步就是使客户端与服务器端的套接流建立联系
        if(socket_connect($socket,'127.0.0.1',22334) == false){
            echo 'connect fail massege:'.socket_strerror(socket_last_error());
        }else{
            $message = 'call somebody Ericsson Ericsson Ericsson';
            //转为GBK编码，处理乱码问题，这要看你的编码情况而定，每个人的编码都不同
            $message = mb_convert_encoding($message,'GBK','UTF-8');
            //向服务端写入字符串信息

            if(socket_write($socket,$message,strlen($message)) == false){
                echo 'fail to write'.socket_strerror(socket_last_error());

            }else{
                echo 'client write success'.PHP_EOL;
                //读取服务端返回来的套接流信息
//                while($callback = socket_read($socket,1024)){
//                    echo 'server return message is:'.PHP_EOL.$callback;
//                }
            }
        }
        socket_close($socket);//工作完毕，关闭套接流


    }

    public function get_video_set()
    {
        $sets = db('video_set')
            ->select();
        echo json_encode($sets,JSON_UNESCAPED_UNICODE);die;
    }

    public function video_set()
    {
        $realsql = new RealsqlModel();
        $sets = $this->request->param();
        $arr = [];
        $arrs = [];
        foreach ($sets as $key=>$val) {
            $key = substr($key,2);
            $arr['id'] = $key;
            $arr['token'] = $val;
            $arrs[] = $arr;
        }
        $res = $realsql->saveAll($arrs);
        if($res){
            $this->return_msg(200, '更新成功！');
        }
//
    }


    public function get_phone()
    {
        $json = '{"code":200,"msg":"获取成功！","data":{"隆兴路":[{"分组名称":"隆兴路","分机号码":"8101","分机名称":"LX01D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8102","分机名称":"LX01D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8103","分机名称":"LX01S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8104","分机名称":"LX01S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8105","分机名称":"LX02D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8106","分机名称":"LX02D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8107","分机名称":"LX02S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8108","分机名称":"LX02S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8109","分机名称":"LX03D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8110","分机名称":"LX03D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8111","分机名称":"LX03S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8112","分机名称":"LX03S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8113","分机名称":"LX04D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8114","分机名称":"LX04D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8115","分机名称":"LX04S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8116","分机名称":"LX04S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8117","分机名称":"LX05D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8118","分机名称":"LX05D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8119","分机名称":"LX05S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8120","分机名称":"LX05S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8121","分机名称":"LX06D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8122","分机名称":"LX06D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8123","分机名称":"LX06S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8124","分机名称":"LX06S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8125","分机名称":"LX07D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8126","分机名称":"LX07D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8127","分机名称":"LX07S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8128","分机名称":"LX07S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8129","分机名称":"LX08D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8130","分机名称":"LX08D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8131","分机名称":"LX08S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8132","分机名称":"LX08S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8133","分机名称":"LX09D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8134","分机名称":"LX09D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8135","分机名称":"LX09S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8136","分机名称":"LX09S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8137","分机名称":"LX10D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8138","分机名称":"LX10D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8139","分机名称":"LX10S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8140","分机名称":"LX10S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8141","分机名称":"LX11D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8142","分机名称":"LX11D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8143","分机名称":"LX11S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8144","分机名称":"LX11S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8145","分机名称":"LX12D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8146","分机名称":"LX12D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8147","分机名称":"LX12S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8148","分机名称":"LX12S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8149","分机名称":"LX13D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8150","分机名称":"LX13D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8151","分机名称":"LX13S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8152","分机名称":"LX13S-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8153","分机名称":"LX14D-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8154","分机名称":"LX14D-02","分机状态":""},{"分组名称":"隆兴路","分机号码":"8155","分机名称":"LX14S-01","分机状态":""},{"分组名称":"隆兴路","分机号码":"8156","分机名称":"LX14S-02","分机状态":""}],"太行大街":[{"分组名称":"太行大街","分机号码":"8157","分机名称":"TH20D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8158","分机名称":"TH20D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8159","分机名称":"TH20S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8160","分机名称":"TH20S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8161","分机名称":"TH19D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8162","分机名称":"TH19D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8163","分机名称":"TH19S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8164","分机名称":"TH19S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8165","分机名称":"TH18D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8166","分机名称":"TH18D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8167","分机名称":"TH18S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8168","分机名称":"TH18S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8169","分机名称":"TH17D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8170","分机名称":"TH17D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8171","分机名称":"TH17S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8172","分机名称":"TH17S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8173","分机名称":"TH16D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8174","分机名称":"TH16D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8175","分机名称":"TH16S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8176","分机名称":"TH16S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8177","分机名称":"TH15D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8178","分机名称":"TH15D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8179","分机名称":"TH15S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8180","分机名称":"TH15S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8181","分机名称":"TH14D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8182","分机名称":"TH14D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8183","分机名称":"TH14S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8184","分机名称":"TH14S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8185","分机名称":"TH13D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8186","分机名称":"TH13D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8187","分机名称":"TH13S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8188","分机名称":"TH13S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8189","分机名称":"TH12D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8190","分机名称":"TH12D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8191","分机名称":"TH12S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8192","分机名称":"TH12S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8193","分机名称":"TH11D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8194","分机名称":"TH11D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8195","分机名称":"TH11S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8196","分机名称":"TH11S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8197","分机名称":"TH10D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8198","分机名称":"TH10D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8199","分机名称":"TH10S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8200","分机名称":"TH10S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8201","分机名称":"TH09D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8202","分机名称":"TH09D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8203","分机名称":"TH09S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8204","分机名称":"TH09S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8205","分机名称":"TH08D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8206","分机名称":"TH08D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8207","分机名称":"TH08S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8208","分机名称":"TH08S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8209","分机名称":"TH07D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8210","分机名称":"TH07D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8211","分机名称":"TH07S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8212","分机名称":"TH07S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8213","分机名称":"TH06D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8214","分机名称":"TH06D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8215","分机名称":"TH06S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8216","分机名称":"TH06S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8217","分机名称":"TH05D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8218","分机名称":"TH05D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8219","分机名称":"TH05S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8220","分机名称":"TH05S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8221","分机名称":"TH04D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8222","分机名称":"TH04D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8223","分机名称":"TH04S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8224","分机名称":"TH04S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8225","分机名称":"TH03D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8226","分机名称":"TH03D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8227","分机名称":"TH03S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8228","分机名称":"TH03S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8229","分机名称":"TH02D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8230","分机名称":"TH02D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8231","分机名称":"TH02S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8232","分机名称":"TH02S-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8233","分机名称":"TH01D-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8234","分机名称":"TH01D-02","分机状态":""},{"分组名称":"太行大街","分机号码":"8235","分机名称":"TH01S-01","分机状态":""},{"分组名称":"太行大街","分机号码":"8236","分机名称":"TH01S-02","分机状态":""}],"新城大街":[{"分组名称":"新城大街","分机号码":"8237","分机名称":"XC01D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8238","分机名称":"XC01D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8239","分机名称":"XC01S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8240","分机名称":"XC01S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8241","分机名称":"XC02D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8242","分机名称":"XC02D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8243","分机名称":"XC02S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8244","分机名称":"XC02S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8245","分机名称":"XC03D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8246","分机名称":"XC03D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8247","分机名称":"XC03S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8248","分机名称":"XC03S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8249","分机名称":"XC04D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8250","分机名称":"XC04D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8251","分机名称":"XC04S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8252","分机名称":"XC04S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8253","分机名称":"XC05D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8254","分机名称":"XC05D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8255","分机名称":"XC05S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8256","分机名称":"XC05S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8257","分机名称":"XC06D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8258","分机名称":"XC06D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8259","分机名称":"XC06S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8260","分机名称":"XC06S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8261","分机名称":"XC07D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8262","分机名称":"XC07D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8263","分机名称":"XC07S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8264","分机名称":"XC07S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8265","分机名称":"XC08D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8266","分机名称":"XC08D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8267","分机名称":"XC08S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8268","分机名称":"XC08S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8269","分机名称":"XC09D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8270","分机名称":"XC09D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8271","分机名称":"XC09S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8272","分机名称":"XC09S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8273","分机名称":"XC10D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8274","分机名称":"XC10D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8275","分机名称":"XC10S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8276","分机名称":"XC10S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8277","分机名称":"XC11D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8278","分机名称":"XC11D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8279","分机名称":"XC11S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8280","分机名称":"XC11S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8281","分机名称":"XC12D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8282","分机名称":"XC12D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8283","分机名称":"XC12S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8284","分机名称":"XC12S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8285","分机名称":"XC13D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8286","分机名称":"XC13D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8287","分机名称":"XC13S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8288","分机名称":"XC13S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8289","分机名称":"XC14D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8290","分机名称":"XC14D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8291","分机名称":"XC14S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8292","分机名称":"XC14S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8293","分机名称":"XC15D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8294","分机名称":"XC15D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8295","分机名称":"XC15S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8296","分机名称":"XC15S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8297","分机名称":"XC16D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8298","分机名称":"XC16D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8299","分机名称":"XC16S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8300","分机名称":"XC16S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8301","分机名称":"XC17D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8302","分机名称":"XC17D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8303","分机名称":"XC17S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8304","分机名称":"XC17S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8305","分机名称":"XC18D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8306","分机名称":"XC18D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8307","分机名称":"XC18S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8308","分机名称":"XC18S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8309","分机名称":"XC19D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8310","分机名称":"XC19D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8311","分机名称":"XC19S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8312","分机名称":"XC19S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8313","分机名称":"XC20D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8314","分机名称":"XC20D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8315","分机名称":"XC20S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8316","分机名称":"XC20S-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8317","分机名称":"XC21D-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8318","分机名称":"XC21D-02","分机状态":""},{"分组名称":"新城大街","分机号码":"8319","分机名称":"XC21S-01","分机状态":""},{"分组名称":"新城大街","分机号码":"8320","分机名称":"XC21S-02","分机状态":""}],"迎旭":[{"分组名称":"迎旭","分机号码":"8321","分机名称":"YX01D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8322","分机名称":"YX01D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8323","分机名称":"YX01S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8324","分机名称":"YX01S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8325","分机名称":"YX02D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8326","分机名称":"YX02D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8327","分机名称":"YX02S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8328","分机名称":"YX02S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8329","分机名称":"YX03D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8330","分机名称":"YX03D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8331","分机名称":"YX03S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8332","分机名称":"YX03S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8333","分机名称":"YX04D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8334","分机名称":"YX04D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8335","分机名称":"YX04S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8336","分机名称":"YX04S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8337","分机名称":"YX05D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8338","分机名称":"YX05D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8339","分机名称":"YX05S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8340","分机名称":"YX05S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8341","分机名称":"YX06D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8342","分机名称":"YX06D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8343","分机名称":"YX06S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8344","分机名称":"YX06S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8345","分机名称":"YX07D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8346","分机名称":"YX07D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8347","分机名称":"YX07S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8348","分机名称":"YX07S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8349","分机名称":"YX08D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8350","分机名称":"YX08D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8351","分机名称":"YX08S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8352","分机名称":"YX08S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8353","分机名称":"YX09D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8354","分机名称":"YX09D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8355","分机名称":"YX09S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8356","分机名称":"YX09S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8357","分机名称":"YX10D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8358","分机名称":"YX10D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8359","分机名称":"YX10S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8360","分机名称":"YX10S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8361","分机名称":"YX11D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8362","分机名称":"YX11D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8363","分机名称":"YX11S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8364","分机名称":"YX11S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8365","分机名称":"YX12D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8366","分机名称":"YX12D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8367","分机名称":"YX12S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8368","分机名称":"YX12S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8369","分机名称":"YX13D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8370","分机名称":"YX13D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8371","分机名称":"YX13S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8372","分机名称":"YX13S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8373","分机名称":"YX14D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8374","分机名称":"YX14D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8375","分机名称":"YX14S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8376","分机名称":"YX14S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8377","分机名称":"YX15D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8378","分机名称":"YX15D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8379","分机名称":"YX15S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8380","分机名称":"YX15S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8381","分机名称":"YX16D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8382","分机名称":"YX16D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8383","分机名称":"YX16S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8384","分机名称":"YX16S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8385","分机名称":"YX17D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8386","分机名称":"YX17D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8387","分机名称":"YX17S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8388","分机名称":"YX17S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8389","分机名称":"YX18D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8390","分机名称":"YX18D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8391","分机名称":"YX18S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8392","分机名称":"YX18S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8393","分机名称":"YX19D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8394","分机名称":"YX19D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8395","分机名称":"YX19S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8396","分机名称":"YX19S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8397","分机名称":"YX20D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8398","分机名称":"YX20D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8399","分机名称":"YX20S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8400","分机名称":"YX20S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8401","分机名称":"YX21D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8402","分机名称":"YX21D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8403","分机名称":"YX21S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8404","分机名称":"YX21S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8405","分机名称":"YX22D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8406","分机名称":"YX22D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8407","分机名称":"YX22S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8408","分机名称":"YX22S-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8409","分机名称":"YX23D-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8410","分机名称":"YX23D-02","分机状态":""},{"分组名称":"迎旭","分机号码":"8411","分机名称":"YX23S-01","分机状态":""},{"分组名称":"迎旭","分机号码":"8412","分机名称":"YX23S-02","分机状态":""}],"园博园":[{"分组名称":"园博园","分机号码":"8413","分机名称":"YBY01D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8414","分机名称":"YBY01D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8415","分机名称":"YBY01S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8416","分机名称":"YBY01S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8417","分机名称":"YBY02D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8418","分机名称":"YBY02D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8419","分机名称":"YBY02S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8420","分机名称":"YBY02S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8421","分机名称":"YBY03D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8422","分机名称":"YBY03D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8423","分机名称":"YBY03S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8424","分机名称":"YBY03S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8425","分机名称":"YBY04D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8426","分机名称":"YBY04D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8427","分机名称":"YBY04S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8428","分机名称":"YBY04S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8429","分机名称":"YBY05D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8430","分机名称":"YBY05D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8431","分机名称":"YBY05S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8432","分机名称":"YBY05S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8433","分机名称":"YBY06D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8434","分机名称":"YBY06D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8435","分机名称":"YBY06S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8436","分机名称":"YBY06S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8437","分机名称":"YBY07D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8438","分机名称":"YBY07D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8439","分机名称":"YBY07S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8440","分机名称":"YBY07S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8441","分机名称":"YBY08D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8442","分机名称":"YBY08D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8443","分机名称":"YBY08S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8444","分机名称":"YBY08S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8445","分机名称":"YBY09D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8446","分机名称":"YBY09D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8447","分机名称":"YBY09S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8448","分机名称":"YBY09S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8449","分机名称":"YBY10D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8450","分机名称":"YBY10D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8451","分机名称":"YBY10S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8452","分机名称":"YBY10S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8453","分机名称":"YBY11D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8454","分机名称":"YBY11D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8455","分机名称":"YBY11S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8456","分机名称":"YBY11S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8457","分机名称":"YBY12D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8458","分机名称":"YBY12D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8459","分机名称":"YBY12S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8460","分机名称":"YBY12S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8461","分机名称":"YBY13D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8462","分机名称":"YBY13D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8463","分机名称":"YBY13S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8464","分机名称":"YBY13S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8465","分机名称":"YBY14D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8466","分机名称":"YBY14D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8467","分机名称":"YBY14S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8468","分机名称":"YBY14S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8469","分机名称":"YBY15D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8470","分机名称":"YBY15D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8471","分机名称":"YBY15S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8472","分机名称":"YBY15S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8473","分机名称":"YBY16D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8474","分机名称":"YBY16D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8475","分机名称":"YBY16S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8476","分机名称":"YBY16S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8477","分机名称":"YBY17D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8478","分机名称":"YBY17D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8479","分机名称":"YBY17S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8480","分机名称":"YBY17S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8481","分机名称":"YBY18D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8482","分机名称":"YBY18D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8483","分机名称":"YBY18S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8484","分机名称":"YBY18S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8485","分机名称":"YBY19D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8486","分机名称":"YBY19D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8487","分机名称":"YBY19S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8488","分机名称":"YBY19S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8489","分机名称":"YBY20D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8490","分机名称":"YBY20D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8491","分机名称":"YBY20S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8492","分机名称":"YBY20S-02","分机状态":""},{"分组名称":"园博园","分机号码":"8493","分机名称":"YBY21D-01","分机状态":""},{"分组名称":"园博园","分机号码":"8494","分机名称":"YBY21D-02","分机状态":""},{"分组名称":"园博园","分机号码":"8495","分机名称":"YBY21S-01","分机状态":""},{"分组名称":"园博园","分机号码":"8496","分机名称":"YBY21S-02","分机状态":""}],"办公":[{"分组名称":"办公","分机号码":"8500","分机名称":"办公1","分机状态":"呼叫失败"},{"分组名称":"办公","分机号码":"8501","分机名称":"办公2","分机状态":"空闲"},{"分组名称":"办公","分机号码":"8502","分机名称":"办公3","分机状态":"呼叫失败"},{"分组名称":"办公","分机号码":"8503","分机名称":"办公4","分机状态":"空闲"}],"手持":[{"分组名称":"手持","分机号码":"2000","分机名称":"手持1","分机状态":""},{"分组名称":"手持","分机号码":"2001","分机名称":"手持2","分机状态":""},{"分组名称":"手持","分机号码":"2002","分机名称":"手持3","分机状态":""},{"分组名称":"手持","分机号码":"2003","分机名称":"手持4","分机状态":""},{"分组名称":"手持","分机号码":"2004","分机名称":"手持5","分机状态":"空闲"},{"分组名称":"手持","分机号码":"2005","分机名称":"手持6","分机状态":""},{"分组名称":"手持","分机号码":"2006","分机名称":"手持7","分机状态":""},{"分组名称":"手持","分机号码":"2007","分机名称":"手持8","分机状态":""},{"分组名称":"手持","分机号码":"2008","分机名称":"手持9","分机状态":""},{"分组名称":"手持","分机号码":"2009","分机名称":"手持10","分机状态":""}],"广播":[{"分组名称":"广播","分机号码":"*05801","分机名称":"办公广播","分机状态":""},{"分组名称":"广播","分机号码":"*05802","分机名称":"隆兴路广播","分机状态":""},{"分组名称":"广播","分机号码":"*05803","分机名称":"太行大街广播","分机状态":""},{"分组名称":"广播","分机号码":"*05804","分机名称":"新城大街广播","分机状态":""},{"分组名称":"广播","分机号码":"*05805","分机名称":"迎旭广播","分机状态":""},{"分组名称":"广播","分机号码":"*05806","分机名称":"园博园广播","分机状态":""}]}}';
        echo $json;die;

        $serverName  =  "192.168.20.50" ;
        $connectionInfo  = array(  "Database" => "RMDDISP" ,  "UID" => "sa" ,  "PWD" => "Qiushi123"  );
        $conn  =  sqlsrv_connect (  $serverName ,  $connectionInfo );
        if(  $conn  ===  false  ) {
            die(  print_r (  sqlsrv_errors (),  true ));
        }
        // print "SQL: $sql\n";
        $sqls='SELECT *  FROM 分机;';//拼接
        $sqls= iconv ( "utf-8", "gb2312//IGNORE", $sqls );//第二次转换，不可省略
        $results = sqlsrv_query($conn , $sqls);//正常运行未报错


        // $result = sqlsrv_query($conn, $sql);
        if($results === false) {
            $this->return_msg(400, '获取失败！');
            die(print_r(sqlsrv_errors(), true));
        }
        #Fetching Data by array
        while($rows = sqlsrv_fetch_array($results, SQLSRV_FETCH_ASSOC)) {
            // $row = iconv('gbk', 'utf-8', $row);
            foreach ($rows as $key => $value) {
                $keys = $this->doEncoding($key);
                $arrs[$keys] = $this->doEncoding($value);
                unset($arrs['唯一序号']);
                unset($arrs['分机号码2']);
                unset($arrs['分机号码3']);
                // unset($arrs['分机状态']);
            }
            $phone_datas[] = $arrs;
        }


        // $str=iconv ( "utf-8", "gb2312//IGNORE", $str ); //第一次转换，不可省略，省略立即报错
        $sql_g='SELECT *  FROM 组分机;';//拼接
        $sql_g= iconv ( "utf-8", "gb2312//IGNORE", $sql_g );//第二次转换，不可省略
        $result_g = sqlsrv_query($conn , $sql_g);//正常运行未报错


        // $result = sqlsrv_query($conn, $sql);
        if($result_g === false) {
            $this->return_msg(400, '获取失败！');
            die(print_r(sqlsrv_errors(), true));
        }
        #Fetching Data by array
        while($row = sqlsrv_fetch_array($result_g, SQLSRV_FETCH_ASSOC)) {
            // $row = iconv('gbk', 'utf-8', $row);
            foreach ($row as $key => $value) {
                $keys = $this->doEncoding($key);
                $arr[$keys] = $this->doEncoding($value);
            }
            $phone_group[] = $arr;
        }



        foreach($phone_group as $k=>$v){
            foreach ($v as $key => $value) {
                # code...
                //去除空格 数据清洗
                $vv[$key] = trim($value," ");
                unset($vv['序号']);

            }
            foreach ($phone_datas as $val) {
                # code...

                if($vv['分机号码'] == $val['分机号码']){
                    $vv['分机名称'] =  $val['分机名称'];
                    $vv['分机状态'] =  $val['分机状态'];
                }
            }
            $phone_groups[$vv['分组名称']][]    =   $vv;

        }
        $res['组分机'] = $phone_groups;
        $res['分机'] = $phone_datas;
        $this->return_msg(200, '获取成功！',$phone_groups);
    }

    public function call_phone()
    {
        $type = $this->request->param('type');
        $from_num = $this->request->param('from_num');
        $call = $this->request->param('call');
//        $this->Socket = new Socketmodel($this->scket_ip,$this->scket_port);
//        $aa = $this->doEncoding($aa);
        $from_name = '';
        $num_or_g = '';
        if ($from_num == 8001){
            $from_name = '调度台1';
        }else if($from_num == 8002){
            $from_name = '调度台2';
        }

        if ($type == '调度组呼'){
            $num_or_g = '分组';
        }else if($type == '调度单呼'){
            $num_or_g = '号码';
        }
        $msg =  $type.' 调度号码='.$from_num.' 调度名称='.$from_name.' '.$num_or_g.'='.$call.chr(13);
        $msgo =  $type.' 调度号码='.$from_num.' 调度名称='.$from_name.' '.$num_or_g.'='.$call;
//        dump($msg);
//        die;
        $msgs= iconv ( "utf-8", "gb2312//IGNORE", $msg );
        $fp = stream_socket_client("udp://192.168.5.111:2008", $errno, $errstr);
        if (!$fp) {
            echo "ERROR: $errno - $errstr<br />\n";
        } else {
            fwrite($fp, $msgs);
            $this->return_msg(200,'呼叫中',$msgo);
//            echo fread($fp, 1024);
            fclose($fp);
        }
    }

    //获取亚控工业实时库 水位 最大 最小 平均值
    public function get_s_logs()
    {
        $sensor = $this->request->param('sensor');
        $conn=odbc_connect('KingHistorian','sa','sa');
        if (!$conn)
        {
            exit("连接失败: " . $conn);
        }

        $sql="SELECT top 7200 * FROM history where TagName like 'QS_".$sensor."%' and DataTime > '2019-10-10' order by DataTime desc";
        $rs=odbc_exec($conn,$sql);

        if (!$rs)
        {
            exit("SQL 语句错误");
        }
        $water_arr = array();
        while (odbc_fetch_row($rs))
        {
//            dump(odbc_result($rs,"DataValue"));
            $water_arr[odbc_result($rs,"DataTime")][] =odbc_result($rs,"DataValue");
            $logs['l_max'][odbc_result($rs,"DataTime")] = max($water_arr[odbc_result($rs,"DataTime")]);
            $logs['l_min'][odbc_result($rs,"DataTime")] = min($water_arr[odbc_result($rs,"DataTime")]);
            $logs['l_avg'][odbc_result($rs,"DataTime")] = array_sum($water_arr[odbc_result($rs,"DataTime")])/count($water_arr[odbc_result($rs,"DataTime")]);
        }
        odbc_close($conn);
        foreach ($logs['l_max'] as $time => $l_max) {
            $l_arr['max'][] = array($time,$l_max);
        }
        foreach ($logs['l_min'] as $time => $l_max) {
            $l_arr['min'][] = array($time,$l_max);
        }
        foreach ($logs['l_avg'] as $time => $l_max) {
            $l_arr['avg'][] = array($time,$l_max);
        }
        $this->return_msg(200,'查询成功！',$l_arr);
    }

    //获取亚控工业实时库 指定传感器 最大 最小 平均值
    public function get_sensor()
    {
        $sensor = $this->request->param('sensor');
        $conn=odbc_connect('KingHistorian','sa','sa');
        if (!$conn)
        {
            exit("连接失败: " . $conn);
        }
        $sql="SELECT * FROM realtime where TagName like 'QS_".$sensor."%'";
        $rs=odbc_exec($conn,$sql);

        if (!$rs)
        {
            exit("SQL 语句错误");
        }
        $water_arr = array();
        while (odbc_fetch_row($rs))
        {
            $water_arr[] =odbc_result($rs,"DataValue");
            $date_time = odbc_result($rs,"DataTime");
        }
        odbc_close($conn);

        $sensor_arr['s_max'] = array($date_time,max($water_arr));
        $sensor_arr['s_min'] = array($date_time,min($water_arr));
        $sensor_arr['s_avg'] = array($date_time,array_sum($water_arr)/count($water_arr));
        $this->return_msg(200,'查询成功！',$sensor_arr);
    }

}